InformationRegisters/ТоварыНацКаталогаИСМПТК.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ТоварыНацКаталогаИСМПТК</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтатусКарточки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыКарточекНацКаталогаИСМПТК</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПубликации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КарточкаЗаполнена</Name>
					<Comment>Служебный признак</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ХарактеристикаНоменклатурыИСМПТК</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЕдиницаИзмеренияИСМПТК</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТорговаяМарка</Name>
					<Comment>brand_name</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОрганизацияИСМПТК</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>GTIN</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИИН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>EAN</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.НоменклатураИСМПТК</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПродукции</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПродукцииИСМПТК</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидУпаковки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыУпаковокИСМПТК</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТНВЭД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ТоварыНацКаталогаИСМПТК/Forms/ФормаВыбора/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)	
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	//Временная заглушка
	ТекстИсключения = НСтр("ru='Форма объекта не предназначена для непосредственного открытия.'");
	ВызватьИсключение ТекстИсключения;
	
	//Список.Отбор.Элементы.Очистить();
	//
	//СтатусКарточки = Параметры.СтатусКарточки;
	//ЭлементОтбора  = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("СтатусКарточки");
	//ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	//ЭлементОтбора.Использование  = Истина;
	//ЭлементОтбора.ПравоеЗначение = СтатусКарточки;
	//
	//Если Параметры.Свойство("Организация") Тогда 
	//	Организация   = Параметры.Организация;
	//	ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Организация");
	//	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	//	ЭлементОтбора.Использование  = Истина;
	//	ЭлементОтбора.ПравоеЗначение = Организация;
	//КонецЕсли;

	//Если Параметры.Свойство("ВидПродукции") Тогда 
	//	ВидПродукции  = Параметры.ВидПродукции;
	//	ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ВидПродукции");
	//	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	//	ЭлементОтбора.Использование  = Истина;
	//	ЭлементОтбора.ПравоеЗначение = ВидПродукции;
	//КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКоманд

&НаКлиенте
Процедура Выбрать(Команда)
	
	ВыбранныеТовары = Элементы.Список.ВыделенныеСтроки;
	МассивТоваров = Новый Массив();
	
	Если Не ВыбранныеТовары.Количество() = 0 Тогда
		Для Каждого Строка Из ВыбранныеТовары Цикл
			ДанныеТовара = Новый Структура();
			ДанныеТовара.Вставить("Номенклатура", 	Строка.Номенклатура);
			ДанныеТовара.Вставить("Характеристика", Строка.Характеристика);
			ДанныеТовара.Вставить("Упаковка", 		Строка.ЕдиницаИзмерения);
			ДанныеТовара.Вставить("GTIN", 			Строка.GTIN);
			МассивТоваров.Добавить(ДанныеТовара);
		КонецЦикла;
	КонецЕсли;
	
	ЭтаФорма.Закрыть(МассивТоваров);
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыФормы

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
		
	ВыбранныйТовар  = Элементы.Список.ТекущиеДанные;
	
	МассивТоваров = Новый Массив();
	ДанныеТовара  = Новый Структура();
	ДанныеТовара.Вставить("Номенклатура", 	ВыбранныйТовар.Номенклатура);
	ДанныеТовара.Вставить("Характеристика", ВыбранныйТовар.Характеристика);
	ДанныеТовара.Вставить("Упаковка", 		ВыбранныйТовар.ЕдиницаИзмерения);
	ДанныеТовара.Вставить("GTIN", 			ВыбранныйТовар.GTIN);
	МассивТоваров.Добавить(ДанныеТовара);
	
	ЭтаФорма.Закрыть(МассивТоваров);

КонецПроцедуры

&НаКлиенте
Процедура СписокПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
КонецПроцедуры

#КонецОбласти
